<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6b82b8245d7fc04453a0796f547e01b63b2b99dad6baba10b0dc9736eb2f27e4","plan_job_ref":"Job Plan Airflow DAGs #494 at https://github.com/cal-itp/data-infra/actions/runs/17111130505","plan_out_hash":"ce40f666fecfc9d797ddcdce7d6b68a63b9445a9679a31eca821b30ad33c1f3e","plan_hash":"fee604d84e7e9d1938953d7fa4505f2c38967e8982d127a10ab1091ee4fca1e6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "4n96EA==" -> (known after apply)
!~      detect_md5hash      = "5Pl4suR1I3b9+9ReEi7/sw==" -> "different hash"
!~      generation          = 1753205762826917 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_all_dag.py"
!~      md5hash             = "5Pl4suR1I3b9+9ReEi7/sw==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "wyUzzg==" -> (known after apply)
!~      detect_md5hash      = "0T0v/tgbSCNEvB0BzxwpSA==" -> "different hash"
!~      generation          = 1754957464449004 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "0T0v/tgbSCNEvB0BzxwpSA==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "q1fYBg==" -> (known after apply)
!~      detect_md5hash      = "JGvU0IztIxJQck4z5C4+4A==" -> "different hash"
!~      generation          = 1753205762527061 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "JGvU0IztIxJQck4z5C4+4A==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "5/NgRA==" -> (known after apply)
!~      detect_md5hash      = "MdNvoU7wORHElOK39j/W7g==" -> "different hash"
!~      generation          = 1751416662895235 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"
!~      md5hash             = "MdNvoU7wORHElOK39j/W7g==" -> (known after apply)
        name                = "data/warehouse/models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #494](https://github.com/cal-itp/data-infra/actions/runs/17111130505)